Revit 2024 API
Curve.Period Property
The period of this curve.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public double Period { get; }
Visual Basic
Public ReadOnly Property Period As Double
	Get
Visual C++
public:
property double Period {
	double get ();
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.InvalidOperationException |  Thrown when the curve is not cyclic.
See Also
Curve Class
Autodesk.Revit.DB Namespace